"%1$@ •••• %2$@" = "%1$@ •••• %2$@";

"+ Add" = "+ Żid";

"Add US bank account" = "Żid kont tal-bank ibbażat ġewwa l-Istati Uniti tal-Amerka";

"Add a card" = "Żid kard";

"Add a payment method" = "Żid metodu tal-pagament";

"Add card" = "Żid kard";

"Add new card" = "Żid karta ġdida";

"Add new payment method" = "Żid metodu tal-ħlas ġdid";

"Add your payment information" = "Żid l-informazzjoni dwar il-pagament tiegħek";

"Approve payment" = "Approva l-pagament";

"Back" = "Lura";

"Bank" = "Bank";

"Bank account" = "Kont tal-bank";

"Buy now or pay later with <img/>" = "Ixtri issa jew ħallas iktar tard grazzi għal <img/>";

"Buy now or pay later with Afterpay" = "Ixtri issa jew ħallas iktar tard b'Afterpay";

"Buy now or pay later with Clearpay" = "Ixtri issa jew ħallas iktar tard bi Clearpay";

"Buy now or pay later with Klarna" = "Ixtri issa jew ħallas iktar tard bi Klarna";

"Buy using a UPI ID" = "Ixtri billi tuża ID UPI";

"By confirming your payment with PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Meta tikkonferma l-pagament b'PayPal tkun qed tħalli lil %@ tiġbor il-flus mill-kont ta' PayPal tiegħek għall-pagamenti tal-ġejjieni skont ir-regoli tagħha.";

"By continuing to Amazon Pay, you allow %@ to charge your Amazon Pay account for future payments in accordance with their terms." = "Meta tkompli għal fuq Amazon Pay, tkun qed tagħti permess lil %@ biex fil-ġejjieni tiġbor il-pagamenti mill-kont Amazon Pay tiegħek skont ir-regoli tagħha.";

"By continuing to Klarna, you allow %@ to charge your Klarna account for future payments in accordance with their terms and Klarna's terms. You can change this at any time in your Klarna app or by reaching out to %@." = "Meta tkompli għal fuq Klarna, tkun qed tagħti permess lil %1$@ biex jiċċarġjaw il-kont ta' Klarna tiegħek għal pagamenti futuri skont it-termini tagħhom u ta' Klarna. Dan tista' tibdlu fi kwalunkwe ħin fl-app ta' Klarna billi tikkuntattja lil %2$@.";

"By continuing to PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Meta tkompli għal PayPal tkun qed tħalli lil %@ tiġbor il-flus mill-kont ta' PayPal tiegħek għall-pagamenti tal-ġejjieni skont ir-regoli tagħha.";

"By continuing to Revolut Pay, you allow %@ to charge your Revolut Pay account for future payments in accordance with their terms." = "Meta tkompli għal Revolut Pay tkun qed tħalli lil %@ tiġbor il-flus mill-kont ta' Revolut Pay tiegħek għall-pagamenti tal-ġejjieni skont ir-regoli tagħha.";

"By continuing, you agree to authorize payments pursuant to <terms>these terms</terms>." = "Meta tkompli tkun qed taqbel li tawtorizza l-pagamenti skont <terms>dar-regoli</terms>.";

"By continuing, you authorize %@ to debit your Cash App account for this payment and future payments in accordance with %@'s terms, until this authorization is revoked. You can change this anytime in your Cash App Settings." = "Meta tkompli tkun qed tagħti permess lil %1$@ biex, sakemm dal-permess jitneħħa, tkun tista' tiġbor il-flus mill-kont Cash App tiegħek għal dal-pagament u għall-pagamenti tal-ġejjieni skont ir-regoli ta' %2$@. Tista' tibdel dil-ħaġa meta trid mill-Għażliet ta' Cash App.";

"By joining Link, you agree to the <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Meta tingħaqad ma' Link tkun qed taqbel mat-<terms>Termini</terms> u l-<privacy>Politika tal-Privatezza</privacy>.";

"By providing your bank account details and confirming this payment, you agree to this Direct Debit Request and the <terms>Direct Debit Request service agreement</terms>, and authorise Stripe Payments Australia Pty Ltd ACN 160 180 343 Direct Debit User ID number 507156 (“Stripe”) to debit your account through the Bulk Electronic Clearing System (BECS) on behalf of %@ (the \"Merchant\") for any amounts separately communicated to you by the Merchant. You certify that you are either an account holder or an authorised signatory on the account listed above." = "Meta tagħtina d-dettalji tal-kont tal-bank tiegħek u tikkonferma dal-pagament tkun qed taqbel ma' dit-Talba tad-Debitu Dirett u mal-<terms>ftehim tas-servizz tat-Talba tad-Debitu Dirett</terms> u tkun qed tagħti s-setgħa lil Stripe Payments Australia Pty Ltd ACN 160 180 343 bin-numru tal-identità tal-Utent tad-Debitu Dirett 507156 (\"Stripe\") biex, f'isem %@ (\"in-Negozjant\"), tiġbor il-flus kollha li talbek in-Negozjant permezz ta' messaġġ ieħor mill-kont tiegħek bil-Bulk Electronic Clearing System (BECS). Int tagħti kelmtek li int jew sid il-kont jew firmatarju awtorizzat tal-kont muri hawn fuq.";

"By providing your card information, you allow %@ to charge your card for future payments in accordance with their terms." = "Meta tagħti l-informazzjoni tal-karta tiegħek, tkun qed tħalli lil %@ tiġbor il-pagamenti tal-ġejjieni mill-karta tiegħek skont ir-regoli tagħha.";

"By providing your email, you agree to create a Link account and save your payment info to Link, according to the Link <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Meta tagħti l-indirizz tal-email tiegħek, tkun qed taqbel li toħloq kont Link u li terfa' l-informazzjoni tal-pagament tiegħek ma' Link, skont ir-<terms>Regoli</terms> u l-<privacy>Politika tal-Privatezza</privacy> ta' Link.";

"By providing your payment information and confirming this payment, you authorise (A) %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and (B) your bank to debit your account in accordance with those instructions. As part of your rights, you are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited. Your rights are explained in a statement that you can obtain from your bank. You agree to receive notifications for future debits up to 2 days before they occur." = "Meta tagħti l-informazzjoni tal-pagament tiegħek u tikkonferma dan il-pagament, tkun qed tawtorizza lil (A) %@ u lil Stripe, l-operatur tas-servizz tal-pagamenti tagħna, biex jibagħtu struzzjonijiet lill-bank tiegħek biex jieħu l-fondi mill-kont tiegħek u (B) lill-bank tiegħek biex jieħu l-fondi mill-kont tiegħek skont dawn l-istruzzjonijiet. Bħala parti mid-drittijiet tiegħek, inti għandek dritt għall-ħlas lura mill-bank tiegħek skont it-termini u l-kundizzjonijiet tal-ftehim tiegħek mal-bank tiegħek. Ħlas lura għandu jintalab fi żmien 8 ġimgħat, li jibdew jgħoddu mid-data li fiha l-fondi jittieħdu mill-kont tiegħek. Id-drittijiet tiegħek huma spjegati f'dikjarazzjoni li tista' tikseb mingħand il-bank tiegħek. Inti taqbel li, sa jumejn qabel, tirċievi notifika kull darba li l-fondi jkunu se jittieħdu mill-kont tiegħek.";

"By providing your phone number, you agree to create a Link account and save your payment info to Link, according to the Link <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Meta tagħti n-numru tal-mowbajl tiegħek, tkun qed taqbel li toħloq kont Link u li terfa' l-informazzjoni tal-pagament tiegħek ma' Link, skont ir-<terms>Regoli</terms> u l-<privacy>Politika tal-Privatezza</privacy> ta' Link.";

"By saving your bank account for %@ you agree to authorize payments pursuant to <terms>these terms</terms>." = "Meta tissejvja l-kont tal-bank tiegħek għal %@ tkun qed taqbel li tawtorizza l-pagamenti skont <terms>dar-regoli</terms>.";

"CPF/CPNJ" = "CPF/CPNJ";

"Cancel and pay another way" = "Ikkanċella u ħallas mod ieħor";

"Choose a payment method" = "Agħżel metodu tal-ħlas";

"Close card scanner" = "Agħlaq l-iskenner tal-kard";

"Confirm" = "Ikkonferma";

"Confirm the payment in your bank or payment app within %@ to complete the purchase." = "Biex tlesti x-xirja kkonferma l-pagament, fl-app tal-bank jew fl-app tal-pagamenti, fi żmien %@.";

"Confirm the payment in your bank's app within %@ to complete the purchase." = "Ikkonferma l-pagament fl-app tal-bank fi żmien %@ biex tlesti x-xirja.";

"Confirm your CVC" = "Ikkonferma l-kodiċi CVC tiegħek";

"Contact information" = "Id-dettalji tal-kuntatt";

"EPS Bank" = "EPS Bank";

"Enter address manually" = "Ikteb l-indirizz int stess";

"FPX Bank" = "FPX Bank";

"I understand that Stripe will be collecting Direct Debits on behalf of %@ and confirm that I am the account holder and the only person required to authorise debits from this account." = "Jiena nifhem li Stripe se tkun qed tiġbor id-Debiti Diretti f'isem %@ u nikkonferma li jiena d-detentur tal-kont u l-unika persuna meħtieġa biex tawtorizza d-debiti minn dan il-kont.";

"IBAN" = "IBAN";

"Manage payment method" = "Ħu ħsieb il-metodu tal-pagament";

"Manage payment methods" = "Ħu ħsieb il-metodi tal-pagament";

"Manage your payment methods" = "Ħu ħsieb il-metodi tal-pagament tiegħek";

"Name on card" = "L-isem fuq il-karta";

"New card" = "Karta ġdida";

"New payment method" = "Metodu tal-pagament ġdid";

"Open your UPI app to approve your payment within %@" = "Iftaħ l-app ta' UPI biex tapprova l-pagamenti tiegħek fi żmien %@";

"Or" = "Jew";

"Or pay using" = "Jew ħallas bil-";

"Or pay with a card" = "Jew ħallas bil-kard";

"Or use" = "Jew uża";

"Or use a card" = "Jew uża karta";

"Pay %@" = "Ħallas %@";

"Pay another way" = "Ħallas mod ieħor";

"Pay faster at %@ and thousands of businesses." = "Ħallas lil %@ u lil eluf ta' negozji oħra iktar malajr.";

"Pay over time with %@" = "Ħallas bin-nifs grazzi għal %@";

"Pay over time with Affirm" = "Ħallas bin-nifs b'Affirm";

"Pay with Link" = "Ħallas b'Link";

"Pay with your bank account in just a few steps." = "Ħallas bil-kont tal-bank tiegħek fi ftit passi.";

"Payment failed" = "Il-pagament ma rnexxiex";

"Please go back and select another payment method" = "Jekk jogħġbok mur lura u agħżel metodu tal-pagament ieħor";

"Point the camera at your card." = "Dawwar il-kamera lejn il-kard tiegħek.";

"Processing..." = "Qed jiġi pproċessat...";

"Przelewy24 Bank" = "Bank permezz ta' Przelewy24";

"Remove card?" = "Tixtieq tneħħi l-karta?";

"Remove payment method" = "Neħħi l-metodu tal-pagament";

"Save" = "Erfa'";

"Save a new payment method" = "Erfa' metodu tal-pagament ġdid";

"Save address" = "Erfa' l-indirizz";

"Save for future payments" = "Erfa' għall-pagamenti fil-ġejjieni";

"Save payment details to %@ for future purchases" = "Erfa' d-dettalji tal-pagamenti f'%@ għax-xirjiet tal-ġejjieni";

"Save this account for future %@ payments" = "Erfa' dal-kont għall-pagament lil %@ tal-ġejjieni";

"Save your bank account in just a few steps." = "Erfa' l-kont tal-bank tiegħek fi ftit passi.";

"Save your info for secure 1-click checkout with Link" = "Erfa' l-informazzjoni tiegħek biex tkun tista' tħallas f'pass wieħed grazzi għal Link";

"Saved" = "Merfugħ";

"Select card" = "Agħżel karta";

"Select payment method" = "Agħżel metodu tal-pagament";

"Select your payment method" = "Agħżel il-metodu tal-ħlas tiegħek";

"Set up" = "Stabilixxi";

"Shipping to %@ is not supported." = "Ma nistgħux nibagħtu l-affarijiet lejn: %@";

"Show menu" = "Uri l-menù";

"Simple, secure one-click payments" = "Pagamenti sempliċi u siguri b'mossa waħda";

"Something went wrong when linking your account.\nPlease try again later." = "Xi ħaġa marret ħażin aħna u norbtu l-kont tiegħek.\nJekk jogħġbok erġa' pprova iktar tard.";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you'll get an email with instructions to finish saving your bank account with %@." = "Stripe se tiddepożita $0.01 fil-kont tiegħek fi żmien jum/jumejn tax-xogħol. Imbagħad se tirċievi email bl-istruzzjonijiet biex tlesti l-proċess li terfa' l-kont tiegħek ma' %@.";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you’ll get an email with instructions to complete payment to %@." = "Stripe se tiddepożita $0.01 fil-kont tiegħek fi żmien jum/jumejn tax-xogħol. Imbagħad se tirċievi email bl-istruzzjonijiet biex tagħmel il-pagament lil %@.";

"The IBAN you entered is incomplete." = "L-IBAN li daħħalt mhux komplut.";

"The IBAN you entered is invalid, \"%@\" is not a supported country code." = "L-IBAN li daħħalt mhux tajjeb, \"%@\" mhux pajjiż li jista' jintuża.";

"Update" = "Ibdel";

"Update card brand" = "Ibdel id-ditta tal-karta";

"View more" = "Uri iktar";

"Your IBAN should start with a two-letter country code." = "L-IBAN tiegħek għandu jibda b'kodiċi tal-pajjiż magħmul minn żewġ ittri.";

"iDEAL Bank" = "Il-Bank iDEAL";
